---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LayoutRuleFixedDistance
source: html/9c6782fa-430d-b31a-1a09-557796f0e56b.htm
---
# LayoutRuleFixedDistance Members

Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.